programming/tool/orgmode.org
#+SETUPFILE: ../../styles/readtheorg.setup
#+TITLE: Org-mode

* Keys

| =C-=  | =Ctrl=   |
|-------+----------|
| =M-=  | =Alt=    |
|-------+----------|
| =S-=  | =Shift=  |
|-------+----------|
| =RET= | =Return= |

* Shortcuts
** 控制

| =C-x= =u=       | 撤销     |
|-----------------+----------|
| =C-x= =C-s=     | 保存     |
|-----------------+----------|
| =C-c= =C-e=     | 导出     |
|-----------------+----------|
| =C-x= =RET= =f= | 设置编码 |

| =M-w= | 复制 |
|-------+------|
| =C-y= | 粘贴 |
|-------+------|
| =C-w= | 剪切 |

** 大纲

| =Tab=       | 循环切换当前大纲状态 |
| =S-Tab=     | 循环切换所有大纲状态 |
|-------------+----------------------|
| =C-c= =C-n= | 上一标题             |
| =C-c= =C-p= | 下一标题             |
|-------------+----------------------|
| =C-c= =C-f= | 上一标题（同级）     |
| =C-c= =C-b= | 下一标题（同级）     |
|-------------+----------------------|
| =C-c= =C-u= | 上一级标题           |
|-------------+----------------------|
| =C-c= =C-j= | 大纲浏览状态         |

** 表格

| =M-S-Up=          | 删除行                     |
| =M-S-Down=        | 添加行                     |
| =M-S-Left=        | 删除列                     |
| =M-S-Right=       | 添加列                     |
|-------------------+----------------------------|
| =M-Up=            | 上移一行                   |
| =M-Down=          | 下移一行                   |
| =M-Left=          | 左移一列                   |
| =M-Right=         | 右移一列                   |
|-------------------+----------------------------|
| =C-c= =C-x= =M-w= | 复制单元格                 |
| =C-c= =C-x= =C-w= | 剪切单元格                 |
| =C-c= =C-x= =C-y= | 粘贴单元格                 |
|-------------------+----------------------------|
| =M-Return=        | 光标之后内容移到下方单元格 |
|-------------------+----------------------------|
| =C-c= =-=         | 下方插入分隔行             |
| =C-c= =Return=    | 下方插入分隔行             |

| =C-c= =~=                         | 创建表格、识别表格 |
|-----------------------------------+--------------------|
| =C-c= @@html:<code>&#39;</code>@@ | 编辑表格           |

** 文本

#+CAPTION: 文本块
| =<s= =Tab= | =#+BEGIN_SRC ... #+END_SRC=         |
|------------+-------------------------------------|
| =<e= =Tab= | =#+BEGIN_EXAMPLE ... #+END_EXAMPLE= |
|------------+-------------------------------------|
| =<q= =Tab= | =#+BEGIN_QUOTE ... #+END_QUOTE=     |

#+CAPTION: 文本行
| =C-S-Backspace= | 删除整行 |

** 搜索

| =C-s= | 开始搜索，到下一处 |

