programming/tool/orgmode.html
---
title: "Org-mode"
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-15 Sat 21:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Victor Chen" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/font.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="../../styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfa61d99">1 Keys</a></li>
<li><a href="#orgab9339e">2 Shortcuts</a>
<ul>
<li><a href="#org6fc07e9">2.1 控制</a></li>
<li><a href="#orge2f9419">2.2 大纲</a></li>
<li><a href="#org5cacf49">2.3 表格</a></li>
<li><a href="#orgf06cf14">2.4 文本</a></li>
<li><a href="#orgb8b61e8">2.5 搜索</a></li>
</ul>
</li>
<li><a href="#org99bfdf7">3 Formatting</a></li>
<li><a href="#orgcc5d195">4 Code Blocks</a></li>
<li><a href="#org6433f98">5 MathJax</a>
<ul>
<li><a href="#org0577c96">5.1 Debug</a></li>
</ul>
</li>
<li><a href="#org0b2f0db">6 PlantUML</a>
<ul>
<li><a href="#org8cce242">6.1 安装</a></li>
<li><a href="#orgcc1274e">6.2 示例</a></li>
<li><a href="#orgdc188a4">6.3 <code>skinparam</code></a></li>
<li><a href="#org5342c86">6.4 Links</a></li>
</ul>
</li>
<li><a href="#orgebad33c">7 Ditaa</a></li>
<li><a href="#org07e5d3d">8 Latex</a>
<ul>
<li><a href="#orgd770c1c">8.1 安装</a></li>
<li><a href="#orgf139cd2">8.2 配置</a></li>
<li><a href="#orgb77aa80">8.3 使用</a></li>
</ul>
</li>
<li><a href="#orgd0155c9">9 修改</a></li>
<li><a href="#orgb676f71">10 安装</a>
<ul>
<li><a href="#orgac39d25">10.1 MacOS</a></li>
</ul>
</li>
<li><a href="#orgad70cf1">11 Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa61d99" class="outline-2">
<h2 id="orgfa61d99"><span class="section-number-2">1</span> Keys</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>C-</code></th>
<th scope="col" class="org-left"><code>Ctrl</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-</code></td>
<td class="org-left"><code>Alt</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>S-</code></td>
<td class="org-left"><code>Shift</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>RET</code></td>
<td class="org-left"><code>Return</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgab9339e" class="outline-2">
<h2 id="orgab9339e"><span class="section-number-2">2</span> Shortcuts</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org6fc07e9" class="outline-3">
<h3 id="org6fc07e9"><span class="section-number-3">2.1</span> 控制</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>C-x</code> <code>u</code></th>
<th scope="col" class="org-left">撤销</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-x</code> <code>C-s</code></td>
<td class="org-left">保存</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>C-e</code></td>
<td class="org-left">导出</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-x</code> <code>RET</code> <code>f</code></td>
<td class="org-left">设置编码</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>M-w</code></th>
<th scope="col" class="org-left">复制</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-y</code></td>
<td class="org-left">粘贴</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-w</code></td>
<td class="org-left">剪切</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orge2f9419" class="outline-3">
<h3 id="orge2f9419"><span class="section-number-3">2.2</span> 大纲</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>Tab</code></th>
<th scope="col" class="org-left">循环切换当前大纲状态</th>
</tr>

<tr>
<th scope="col" class="org-left"><code>S-Tab</code></th>
<th scope="col" class="org-left">循环切换所有大纲状态</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>C-n</code></td>
<td class="org-left">上一标题</td>
</tr>

<tr>
<td class="org-left"><code>C-c</code> <code>C-p</code></td>
<td class="org-left">下一标题</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>C-f</code></td>
<td class="org-left">上一标题（同级）</td>
</tr>

<tr>
<td class="org-left"><code>C-c</code> <code>C-b</code></td>
<td class="org-left">下一标题（同级）</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>C-u</code></td>
<td class="org-left">上一级标题</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>C-j</code></td>
<td class="org-left">大纲浏览状态</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5cacf49" class="outline-3">
<h3 id="org5cacf49"><span class="section-number-3">2.3</span> 表格</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>M-S-Up</code></th>
<th scope="col" class="org-left">删除行</th>
</tr>

<tr>
<th scope="col" class="org-left"><code>M-S-Down</code></th>
<th scope="col" class="org-left">添加行</th>
</tr>

<tr>
<th scope="col" class="org-left"><code>M-S-Left</code></th>
<th scope="col" class="org-left">删除列</th>
</tr>

<tr>
<th scope="col" class="org-left"><code>M-S-Right</code></th>
<th scope="col" class="org-left">添加列</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>M-Up</code></td>
<td class="org-left">上移一行</td>
</tr>

<tr>
<td class="org-left"><code>M-Down</code></td>
<td class="org-left">下移一行</td>
</tr>

<tr>
<td class="org-left"><code>M-Left</code></td>
<td class="org-left">左移一列</td>
</tr>

<tr>
<td class="org-left"><code>M-Right</code></td>
<td class="org-left">右移一列</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>C-x</code> <code>M-w</code></td>
<td class="org-left">复制单元格</td>
</tr>

<tr>
<td class="org-left"><code>C-c</code> <code>C-x</code> <code>C-w</code></td>
<td class="org-left">剪切单元格</td>
</tr>

<tr>
<td class="org-left"><code>C-c</code> <code>C-x</code> <code>C-y</code></td>
<td class="org-left">粘贴单元格</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>M-Return</code></td>
<td class="org-left">光标之后内容移到下方单元格</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>-</code></td>
<td class="org-left">下方插入分隔行</td>
</tr>

<tr>
<td class="org-left"><code>C-c</code> <code>Return</code></td>
<td class="org-left">下方插入分隔行</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>C-c</code> <code>~</code></th>
<th scope="col" class="org-left">创建表格、识别表格</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>C-c</code> <code>&#39;</code></td>
<td class="org-left">编辑表格</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf06cf14" class="outline-3">
<h3 id="orgf06cf14"><span class="section-number-3">2.4</span> 文本</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> 文本块</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>&lt;s</code> <code>Tab</code></th>
<th scope="col" class="org-left"><code>#+BEGIN_SRC ... #+END_SRC</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&lt;e</code> <code>Tab</code></td>
<td class="org-left"><code>#+BEGIN_EXAMPLE ... #+END_EXAMPLE</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&lt;q</code> <code>Tab</code></td>
<td class="org-left"><code>#+BEGIN_QUOTE ... #+END_QUOTE</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> 文本行</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-S-Backspace</code></td>
<td class="org-left">删除整行</td>
</tr>
</tbody>
</table>
</div>
</div>
