programming/tool/orgmode.org
* Formatting

| HTML     | =@@html:= ... =@@=     |
|----------+------------------------|
| 链接     | =[[<link>][<label>]]=              |
|          | =[[file:<targer>.org::<anchor>][<label>]]=              |
|          | =[[file:<target>.html#<anchor>][<label>]]=              |
|----------+------------------------|
| 锚点     | =<<anchor>>=           |
|          | =[[<anchor>][<label>]]=              |
|----------+------------------------|
| 代码     | ~=code=~               |
|          | =~code~=               |
|----------+------------------------|
| 定义列表 | =- name :: definition= |

| 表格中转义 @@html:<code>&#124;</code>@@ | =@@html:<code>&#124;</code>@@= |
|-----------------------------------------+--------------------------------|
| 表格列左对齐                            | =<l>=                          |
|-----------------------------------------+--------------------------------|
| 段落内换行                              | =\\=                           |

| 图片、表格标题 | =#+CAPTION: <text>=                |
|----------------+------------------------------------|
| HTML 属性      | =#+ATTR_HTML: :<attr> <value> ...= |
|                | e.g. =#+ATTR_HTML: :class special= |

* Code Blocks

不输出代码块（直接嵌入生成的文件，不用每次输出时重新生成）：

#+BEGIN_SRC code
\#+BEGIN_SRC ... :exports none
#+END_SRC

* MathJax

#+CAPTION: 行内
#+BEGIN_SRC text
$ ... $
\( ... \)
#+END_SRC

#+CAPTION: 段落
#+BEGIN_SRC text
\begin{equation} ... \end{equation}
$$ ... $$
\[ ... \]
#+END_SRC

** Debug

#+BEGIN_SRC lisp
;; site-lisp/org/lisp/ox-html.el
;; line 1031
tex2jax: {
    inlineMath: [ ['$', '$'], [\"\\\\(\",\"\\\\)\"] ],
    ...
}
#+END_SRC

* PlantUML
** 安装

安装 Graphviz 和 PlantUML：

#+BEGIN_SRC sh
brew install graphviz
brew install plantuml
#+END_SRC

将 =plantuml.jar= 放置到 =emacs/etc/= 。修改 =config/.emacs= ：

#+BEGIN_SRC lisp
;; PlantUML, active Org-babel languages
(org-babel-do-load-languages
  'org-babel-load-languages
  '(;; other Babel languages
    (plantuml . t)))
(setq org-plantuml-jar-path
  (expand-file-name "../etc/plantuml.jar"))
#+END_SRC

** 示例

#+BEGIN_SRC code
\#+BEGIN_SRC plantuml :file ../images/01.svg
@startuml
!include ../../styles/plantuml-style
...
@enduml
\#+END_SRC
#+END_SRC

In newer versions, the start and end tags can be omitted:

#+BEGIN_SRC code
\#+BEGIN_SRC plantuml :file ../images/01.svg
!include ../../styles/plantuml-style
...
\#+END_SRC
#+END_SRC

** =skinparam=

| =monochrome= | Boolean | 单色主题 |
|--------------+---------+----------|
| =shadowing=  | Boolean | 显示阴影 |

** Links

1. [[http://sdntutorials.com/steps-to-install-plantuml-on-windows-7/][Steps To Install PlantUML On Windows 7]]
1. [[http://plantuml.com/][PlantUML in a nutshell]]
1. [[https://plantuml.com/skinparam][PlantUML | =skinparam=]]

* Ditaa

#+BEGIN_SRC code
\#+BEGIN_SRC ditaa :file <path> :cmdline <options>
...
\#+END_SRC
#+END_SRC

#+CAPTION: Options
| =-E=         | Prevents the separation of common edges of shapes |
|--------------+---------------------------------------------------|
| =-S=         | Turns off the drop-shadow effect                  |
|--------------+---------------------------------------------------|
| =-s <float>= | Scale                                             |

* Latex
** 安装

1 - 安装 [[http://miktex.org/download][MikTEX]] ，注意安装路径中不能有空格

2 - 将 AUCTex 文件覆盖到 emacs 文件夹下

#+CAPTION: 4 - 测试代码
#+BEGIN_SRC text
\#+BEGIN_SRC latex :file ../images/test.png
\LaTeX
\#+END_SRC
#+END_SRC

3 - 安装 [[http://www.imagemagick.org/script/binary-releases.php#windows][ImageMagick]]

4 - 安装 [[http://ghostscript.com/download/gsdnld.html][Ghostscript]]

** 配置

#+CAPTION: 使用 Latex
#+BEGIN_SRC text
(load "auctex.el" nil t t)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((latex . t)))
#+END_SRC

#+CAPTION: 默认样式
#+BEGIN_SRC text
(setq org-format-latex-options
 '(:foreground "Black"
   :background "Transparent"
   :scale 2.0
   :html-foreground "Black"
   :html-background "Transparent"
   :html-scale 2.0
   :matchers ("begin" "$1" "$$" "\\(" "\\[")))
#+END_SRC

#+CAPTION: 使用 TikZ
#+BEGIN_SRC text
(add-to-list 'org-latex-packages-alist '("" "tikz" "") t)
(setq
 org-format-latex-header
 (concat
  org-format-latex-header
  "\n\\usepackage[active,tightpage]{preview}\n\\PreviewEnvironment{tikzpicture}"))
#+END_SRC

