programming/tool/orgmode.html

<div id="outline-container-orgb8b61e8" class="outline-3">
<h3 id="orgb8b61e8"><span class="section-number-3">2.5</span> 搜索</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>C-s</code></td>
<td class="org-left">开始搜索，到下一处</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org99bfdf7" class="outline-2">
<h2 id="org99bfdf7"><span class="section-number-2">3</span> Formatting</h2>
<div class="outline-text-2" id="text-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">HTML</th>
<th scope="col" class="org-left"><code>@@html:</code> &#x2026; <code>@@</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">链接</td>
<td class="org-left"><code>[[&lt;link&gt;][&lt;label&gt;]]</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>[[file:&lt;targer&gt;.org::&lt;anchor&gt;][&lt;label&gt;]]</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>[[file:&lt;target&gt;.html#&lt;anchor&gt;][&lt;label&gt;]]</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">锚点</td>
<td class="org-left"><code>&lt;&lt;anchor&gt;&gt;</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>[[&lt;anchor&gt;][&lt;label&gt;]]</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">代码</td>
<td class="org-left"><code>=code=</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>~code~</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">定义列表</td>
<td class="org-left"><code>- name :: definition</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">表格中转义 <code>&#124;</code></th>
<th scope="col" class="org-left"><code>@@html:&lt;code&gt;&amp;#124;&lt;/code&gt;@@</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">表格列左对齐</td>
<td class="org-left"><code>&lt;l&gt;</code></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">段落内换行</td>
<td class="org-left"><code>\\</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">图片、表格标题</th>
<th scope="col" class="org-left"><code>#+CAPTION: &lt;text&gt;</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">HTML 属性</td>
<td class="org-left"><code>#+ATTR_HTML: :&lt;attr&gt; &lt;value&gt; ...</code></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">e.g. <code>#+ATTR_HTML: :class special</code></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgcc5d195" class="outline-2">
<h2 id="orgcc5d195"><span class="section-number-2">4</span> Code Blocks</h2>
<div class="outline-text-2" id="text-4">
<p>
不输出代码块（直接嵌入生成的文件，不用每次输出时重新生成）：
</p>

<div class="org-src-container">
<pre class="src src-code">\#+BEGIN_SRC ... :exports none
</pre>
</div>
</div>
</div>

<div id="outline-container-org6433f98" class="outline-2">
<h2 id="org6433f98"><span class="section-number-2">5</span> MathJax</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>行内</label><pre class="src src-text">$ ... $
\( ... \)
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>段落</label><pre class="src src-text">\begin{equation} ... \end{equation}
$$ ... $$
\[ ... \]
</pre>
</div>
</div>

<div id="outline-container-org0577c96" class="outline-3">
<h3 id="org0577c96"><span class="section-number-3">5.1</span> Debug</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">site-lisp/org/lisp/ox-html.el</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">line 1031</span>
tex2jax: {
    inlineMath: [ ['$', '$'], [\"\\\\(\",\"\\\\)\"] ],
    ...
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0b2f0db" class="outline-2">
<h2 id="org0b2f0db"><span class="section-number-2">6</span> PlantUML</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-org8cce242" class="outline-3">
<h3 id="org8cce242"><span class="section-number-3">6.1</span> 安装</h3>
<div class="outline-text-3" id="text-6-1">
<p>
安装 Graphviz 和 PlantUML：
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install graphviz
brew install plantuml
</pre>
</div>

<p>
将 <code>plantuml.jar</code> 放置到 <code>emacs/etc/</code> 。修改 <code>config/.emacs</code> ：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">PlantUML, active Org-babel languages</span>
(org-babel-do-load-languages
  'org-babel-load-languages
  '(<span class="org-comment-delimiter">;; </span><span class="org-comment">other Babel languages</span>
    (plantuml . t)))
(setq org-plantuml-jar-path
  (expand-file-name <span class="org-string">"../etc/plantuml.jar"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcc1274e" class="outline-3">
<h3 id="orgcc1274e"><span class="section-number-3">6.2</span> 示例</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-code">\#+BEGIN_SRC plantuml :file ../images/01.svg
@startuml
!include ../../styles/plantuml-style
...
@enduml
\#+END_SRC
</pre>
</div>

<p>
In newer versions, the start and end tags can be omitted:
</p>

<div class="org-src-container">
<pre class="src src-code">\#+BEGIN_SRC plantuml :file ../images/01.svg
!include ../../styles/plantuml-style
...
\#+END_SRC
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc188a4" class="outline-3">
<h3 id="orgdc188a4"><span class="section-number-3">6.3</span> <code>skinparam</code></h3>
<div class="outline-text-3" id="text-6-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>monochrome</code></th>
<th scope="col" class="org-left">Boolean</th>
<th scope="col" class="org-left">单色主题</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>shadowing</code></td>
<td class="org-left">Boolean</td>
<td class="org-left">显示阴影</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5342c86" class="outline-3">
<h3 id="org5342c86"><span class="section-number-3">6.4</span> Links</h3>
<div class="outline-text-3" id="text-6-4">
<ol class="org-ol">
<li><a href="http://sdntutorials.com/steps-to-install-plantuml-on-windows-7/">Steps To Install PlantUML On Windows 7</a></li>
<li><a href="http://plantuml.com/">PlantUML in a nutshell</a></li>
<li><a href="https://plantuml.com/skinparam">PlantUML | <code>skinparam</code></a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgebad33c" class="outline-2">
<h2 id="orgebad33c"><span class="section-number-2">7</span> Ditaa</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-code">\#+BEGIN_SRC ditaa :file &lt;path&gt; :cmdline &lt;options&gt;
...
\#+END_SRC
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Options</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>-E</code></th>
<th scope="col" class="org-left">Prevents the separation of common edges of shapes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>-S</code></td>
<td class="org-left">Turns off the drop-shadow effect</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>-s &lt;float&gt;</code></td>
<td class="org-left">Scale</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org07e5d3d" class="outline-2">
<h2 id="org07e5d3d"><span class="section-number-2">8</span> Latex</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgd770c1c" class="outline-3">
<h3 id="orgd770c1c"><span class="section-number-3">8.1</span> 安装</h3>
<div class="outline-text-3" id="text-8-1">
<p>
1 - 安装 <a href="http://miktex.org/download">MikTEX</a> ，注意安装路径中不能有空格
</p>

<p>
2 - 将 AUCTex 文件覆盖到 emacs 文件夹下
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>4 - 测试代码</label><pre class="src src-text">\#+BEGIN_SRC latex :file ../images/test.png
\LaTeX
\#+END_SRC
</pre>
</div>

<p>
3 - 安装 <a href="http://www.imagemagick.org/script/binary-releases.php#windows">ImageMagick</a>
</p>

<p>
4 - 安装 <a href="http://ghostscript.com/download/gsdnld.html">Ghostscript</a>
</p>
</div>
</div>

<div id="outline-container-orgf139cd2" class="outline-3">
<h3 id="orgf139cd2"><span class="section-number-3">8.2</span> 配置</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>使用 Latex</label><pre class="src src-text">(load "auctex.el" nil t t)
(org-babel-do-load-languages
 'org-babel-load-languages
 '((latex . t)))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 5: </span>默认样式</label><pre class="src src-text">(setq org-format-latex-options
 '(:foreground "Black"
   :background "Transparent"
   :scale 2.0
   :html-foreground "Black"
   :html-background "Transparent"
   :html-scale 2.0
   :matchers ("begin" "$1" "$$" "\\(" "\\[")))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 6: </span>使用 TikZ</label><pre class="src src-text">(add-to-list 'org-latex-packages-alist '("" "tikz" "") t)
(setq
 org-format-latex-header
 (concat
  org-format-latex-header
  "\n\\usepackage[active,tightpage]{preview}\n\\PreviewEnvironment{tikzpicture}"))
</pre>
</div>
</div>
</div>
