programming/tool/orgmode.org
** 使用

遇到错误信息 =Failed to create dvi file from c:/.../*.tex= ，执行该文件，会使用 MikTEX 编辑器打开，尝试手动输出，会提示安装缺失的包。

遇到错误信息 =Failed to create png file from c:/.../*.tex= ，在命令行执行 =dvipng c:/.../*.dvi= （注意后缀变为 =dvi=），会提示安装缺失的包。

-----

#+CAPTION: 加载包
#+BEGIN_SRC text
#+LATEX_HEADER: \usepackage{...}
#+END_SRC

-----

#+CAPTION: 使用 imagemagick 输出 svg
#+BEGIN_SRC text
#+HEADER: :imagemagick yes :iminoptions -density 600 :imoutoptions -geometry 400
#+HEADER: :file ../images/.../.svg
\#+BEGIN_SRC latex
\begin{tikzpicture}
...
\end{tikzpicture}
\#+END_SRC
#+END_SRC

-----

#+CAPTION: 使用 dvisvgm 输出 svg
#+BEGIN_SRC text
#+HEADER: :file ../images/.../.svg
\#+BEGIN_SRC latex
\begin{tikzpicture}
...
\end{tikzpicture}
\#+END_SRC
#+END_SRC

使用 dvisvgm 输出 svg，需要先修改 Org-mode 代码。

#+CAPTION: 修改 =site-lisp/org/lisp/ob-latex.el=
#+BEGIN_SRC lisp
;; Line 95
((and (string-match "\\.svg$" out-file) (not imagemagick))
 (org-create-formula-image
  body out-file org-format-latex-options in-buffer))
#+END_SRC

#+CAPTION: 修改 =site-lisp/org/lisp/org.el=
#+BEGIN_SRC lisp
;; Line 18623
(if (featurep 'xemacs)
    (call-process "dvisvgm" nil nil nil
          ;;"-fg" fg "-bg" bg
          ;;"-T" "tight"
          ;;"-Z" "1.5"
          "-o" pngfile
          "--no-fonts"
          dvifile)
    (call-process "dvisvgm" nil nil nil
          ;;"-fg" fg "-bg" bg
          ;;"-D" dpi
          ;;"-x" scale "-y" scale
          ;;"-T" "tight"
          ;;"-Z" "1.5"
          "-o" pngfile
          "--no-fonts"
          dvifile))
#+END_SRC
* 修改

=<blockquote>= 输出标题：

#+BEGIN_SRC lisp
; \site-lisp\org\lisp\ox-html.el line 2979
(defun org-html-quote-block (quote-block contents info)
  "Transcode a QUOTE-BLOCK element from Org to HTML.
CONTENTS holds the contents of the block.  INFO is a plist
holding contextual information."
  ; (format "<blockquote>\n%s</blockquote>" contents))
  (let ((caption (org-export-get-caption quote-block)))
   (format
    "<div class=\"org-quote-container\">\n%s%s\n</div>"
    (if (not caption) ""
      (format "<label class=\"org-src-name\">%s</label>"
        (org-export-data caption info)))
    (format "<blockquote>\n%s</blockquote>" contents))))
#+END_SRC

* 安装
** MacOS

#+BEGIN_SRC sh
brew cask install emacs
ln -s ~/Dropbox/portable/orgmode/config/.emacs ~/.emacs
#+END_SRC

* Links

1. [[http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html][Emacs org-mode examples and cookbook]]
1. [[http://orgmode.org/worg/org-tutorials/index.html][Org tutorials]]
1. [[http://orgmode.org/manual/index.html][The Org Manual]]
1. [[http://orgmode.org/orgcard.txt][Org-Mode Reference Card]]
1. [[http://orgmode.org/worg/org-faq.html][Org-mode Frequently Asked Questions]]
1. [[http://doc.norang.ca/org-mode.html][Org Mode - Organize Your Life In Plain Text!]]
1. [[http://www.cnblogs.com/holbrook/archive/2012/04/12/2444992.html][Org-mode: 最好的文档编辑利器]]
1. [[http://aaronbedra.com/emacs.d/][Aaron Bedra's Emacs 24 Configuration]]

-----

1. [[http://orgmode.org/worg/org-symbols.html][Symbols in Org-mode]]
1. [[http://www.yann-ollivier.org/latex/texsymbols.pdf][The Comprehensive LaTeX Symbol List]]
1. [[http://detexify.kirelabs.org/classify.html][Detexify]]

-----

1. [[http://www.martinkeefe.com/math/mathjax3][MATHJAX GUIDE - MATH SYMBOLS AND MATH FONTS]]
1. [[http://www.suluclac.com/Wiki+MathJax+Syntax][Wiki MathJax Syntax]]
1. [[http://meta.math.stackexchange.com/questions/5020/mathjax-basic-tutorial-and-quick-reference][MathJax basic tutorial and quick reference]]

-----

1. [[http://ditaa.sourceforge.net/][Ditaa]]
