programming/tool/orgmode.html

<div id="outline-container-orgb77aa80" class="outline-3">
<h3 id="orgb77aa80"><span class="section-number-3">8.3</span> 使用</h3>
<div class="outline-text-3" id="text-8-3">
<p>
遇到错误信息 <code>Failed to create dvi file from c:/.../*.tex</code> ，执行该文件，会使用 MikTEX 编辑器打开，尝试手动输出，会提示安装缺失的包。
</p>

<p>
遇到错误信息 <code>Failed to create png file from c:/.../*.tex</code> ，在命令行执行 <code>dvipng c:/.../*.dvi</code> （注意后缀变为 =dvi=），会提示安装缺失的包。
</p>

<hr />

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 7: </span>加载包</label><pre class="src src-text">#+LATEX_HEADER: \usepackage{...}
</pre>
</div>

<hr />

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 8: </span>使用 imagemagick 输出 svg</label><pre class="src src-text">#+HEADER: :imagemagick yes :iminoptions -density 600 :imoutoptions -geometry 400
#+HEADER: :file ../images/.../.svg
\#+BEGIN_SRC latex
\begin{tikzpicture}
...
\end{tikzpicture}
\#+END_SRC
</pre>
</div>

<hr />

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 9: </span>使用 dvisvgm 输出 svg</label><pre class="src src-text">#+HEADER: :file ../images/.../.svg
\#+BEGIN_SRC latex
\begin{tikzpicture}
...
\end{tikzpicture}
\#+END_SRC
</pre>
</div>

<p>
使用 dvisvgm 输出 svg，需要先修改 Org-mode 代码。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 10: </span>修改 <code>site-lisp/org/lisp/ob-latex.el</code></label><pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Line 95</span>
((and (string-match <span class="org-string">"\\.svg$"</span> out-file) (not imagemagick))
 (org-create-formula-image
  body out-file org-format-latex-options in-buffer))
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 11: </span>修改 <code>site-lisp/org/lisp/org.el</code></label><pre class="src src-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Line 18623</span>
(<span class="org-keyword">if</span> (featurep 'xemacs)
    (call-process <span class="org-string">"dvisvgm"</span> nil nil nil
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-fg" fg "-bg" bg</span>
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-T" "tight"</span>
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-Z" "1.5"</span>
          <span class="org-string">"-o"</span> pngfile
          <span class="org-string">"--no-fonts"</span>
          dvifile)
    (call-process <span class="org-string">"dvisvgm"</span> nil nil nil
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-fg" fg "-bg" bg</span>
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-D" dpi</span>
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-x" scale "-y" scale</span>
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-T" "tight"</span>
          <span class="org-comment-delimiter">;;</span><span class="org-comment">"-Z" "1.5"</span>
          <span class="org-string">"-o"</span> pngfile
          <span class="org-string">"--no-fonts"</span>
          dvifile))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd0155c9" class="outline-2">
<h2 id="orgd0155c9"><span class="section-number-2">9</span> 修改</h2>
<div class="outline-text-2" id="text-9">
<p>
<code>&lt;blockquote&gt;</code> 输出标题：
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-comment-delimiter">; </span><span class="org-comment">\site-lisp\org\lisp\ox-html.el line 2979</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">org-html-quote-block</span> (quote-block contents info)
  <span class="org-doc">"Transcode a QUOTE-BLOCK element from Org to HTML.</span>
<span class="org-doc">CONTENTS holds the contents of the block.  INFO is a plist</span>
<span class="org-doc">holding contextual information."</span>
  <span class="org-comment">; (format "&lt;blockquote&gt;\n%s&lt;/blockquote&gt;" contents))</span>
  (<span class="org-keyword">let</span> ((caption (org-export-get-caption quote-block)))
   (format
    <span class="org-string">"&lt;div class=\"org-quote-container\"&gt;\n%s%s\n&lt;/div&gt;"</span>
    (<span class="org-keyword">if</span> (not caption) <span class="org-string">""</span>
      (format <span class="org-string">"&lt;label class=\"org-src-name\"&gt;%s&lt;/label&gt;"</span>
        (org-export-data caption info)))
    (format <span class="org-string">"&lt;blockquote&gt;\n%s&lt;/blockquote&gt;"</span> contents))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb676f71" class="outline-2">
<h2 id="orgb676f71"><span class="section-number-2">10</span> 安装</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgac39d25" class="outline-3">
<h3 id="orgac39d25"><span class="section-number-3">10.1</span> MacOS</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">
<pre class="src src-sh">brew cask install emacs
ln -s ~/Dropbox/portable/orgmode/config/.emacs ~/.emacs
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgad70cf1" class="outline-2">
<h2 id="orgad70cf1"><span class="section-number-2">11</span> Links</h2>
<div class="outline-text-2" id="text-11">
<ol class="org-ol">
<li><a href="http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html">Emacs org-mode examples and cookbook</a></li>
<li><a href="http://orgmode.org/worg/org-tutorials/index.html">Org tutorials</a></li>
<li><a href="http://orgmode.org/manual/index.html">The Org Manual</a></li>
<li><a href="http://orgmode.org/orgcard.txt">Org-Mode Reference Card</a></li>
<li><a href="http://orgmode.org/worg/org-faq.html">Org-mode Frequently Asked Questions</a></li>
<li><a href="http://doc.norang.ca/org-mode.html">Org Mode - Organize Your Life In Plain Text!</a></li>
<li><a href="http://www.cnblogs.com/holbrook/archive/2012/04/12/2444992.html">Org-mode: 最好的文档编辑利器</a></li>
<li><a href="http://aaronbedra.com/emacs.d/">Aaron Bedra's Emacs 24 Configuration</a></li>
</ol>

<hr />

<ol class="org-ol">
<li><a href="http://orgmode.org/worg/org-symbols.html">Symbols in Org-mode</a></li>
<li><a href="http://www.yann-ollivier.org/latex/texsymbols.pdf">The Comprehensive LaTeX Symbol List</a></li>
<li><a href="http://detexify.kirelabs.org/classify.html">Detexify</a></li>
</ol>

<hr />

<ol class="org-ol">
<li><a href="http://www.martinkeefe.com/math/mathjax3">MATHJAX GUIDE - MATH SYMBOLS AND MATH FONTS</a></li>
<li><a href="http://www.suluclac.com/Wiki+MathJax+Syntax">Wiki MathJax Syntax</a></li>
<li><a href="http://meta.math.stackexchange.com/questions/5020/mathjax-basic-tutorial-and-quick-reference">MathJax basic tutorial and quick reference</a></li>
</ol>

<hr />

<ol class="org-ol">
<li><a href="http://ditaa.sourceforge.net/">Ditaa</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Chen</p>
<p class="date">Created: 2020-02-15 Sat 21:26</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
